SkyHao723/sweeper_chassis/firmware/stm32-chassis/user/main.c
/*-------------------------- CAN --------------------------------*/
#define MOTOR1_CAN_ID      0x1101E600UL
#define MOTOR2_CAN_ID      0x1201E600UL
#define MOTOR1_REPLY_ID    (MOTOR1_CAN_ID + 1UL)   /* 控制帧回码 */
#define MOTOR2_REPLY_ID    (MOTOR2_CAN_ID + 1UL)
#define MOTOR1_REPORT_ID   (MOTOR1_CAN_ID + 3UL)   /* 定时上报帧 */

#define MODE_SPEED         0x05
#define MODE_POSITION      0x06
#define CTRL_ENABLE        0x01
#define CTRL_DISABLE       0x02
#define CTRL_BRAKE         0x03

/* 故障码 (FOC_CH4-V1.2 第 11 页附表), 回码 DATA1 / 上报帧 DATA2 */
#define FOC_FAULT_NONE       0
#define FOC_FAULT_DRIVER     1
#define FOC_FAULT_OVERCURR   5
#define FOC_FAULT_OVERVOLT   6
#define FOC_FAULT_UNDERVOLT  7    /* 24V 电池带 36V 额定电机, 重点怀疑对象 */
#define FOC_FAULT_OVERTEMP   8
#define FOC_FAULT_HALL_M2    23
#define FOC_FAULT_HALL_M1    24
#define FOC_FAULT_STALL_M2   25
#define FOC_FAULT_STALL_M1   26
#define FOC_FAULT_UART       27
#define FOC_FAULT_RS485      28
#define FOC_FAULT_CAN        29

/*------------------ 命令帧的加减速斜坡 (DATA4 / DATA5) ------------
 *  驱动器文档原文: "当前转速为 0rpm, 目标 100rpm, 若设置间隔为 1ms,
 *  则目标转速值每 1ms 加 1, 直至 100rpm"。
 *  即 DATA4 的单位是 **ms / 每 1 RPM**, 范围 0~100, 0 = 阶跃(响应最快)。
 *
 *  ★ 现在改回 0 (阶跃)。原因:
 *    当初从 0 改成 3 是为了让起步柔和、少顶过流保护, 但**一直没做 A/B**。
 *    后来实测发现底盘直线会漂 (用户目测 2 米偏 40°, 约 20°/m), 而在更早
 *    (还是 ESP32 当上位机的年代) 的记录里是 7.4°/m —— 也就是变差了 2.7 倍。
 *    命令帧格式两代完全一致(厂商 Cmd_Vel_Callback 和自己写的 ESP32 发的
 *    是同一套 11 字节), CAN 重发周期也都是 20ms, **两代之间唯一的运动相关
 *    差异就是这个斜坡参数**。所以先把它改回 0, 把变量消掉再看。
 *
 *    如果改回 0 之后漂移没变化, 说明斜坡无关, 那就是驱动器速度环本身的
 *    问题(它确实在振荡: 目标 18RPM 时实际在 0~22 之间来回冲)。
 *    那时再把斜坡加回来也不迟 —— 它本来是为了柔顺, 不是为了准确。
 *
 *  减速保持 0: 要停就立刻停, 别拖泥带水(停车安全优先)。 */
#define ACCEL_STEP_MS      0
#define DECEL_STEP_MS      0

/*-------------------------- 协议 --------------------------------*/
#define CMD_FRAME_SIZE     11
#define CMD_HEAD           0x7B
#define TEL_FRAME_SIZE     24
#define TEL_HEAD           0x7B
#define TEL_TAIL           0x7D
#define DIAG_FRAME_SIZE    36
#define DIAG_HEAD          0x7E
#define DIAG_TAIL          0x7D

/* 命令帧里的功能码(f[1]), 沿用协议里"非速度帧靠功能码区分"的做法。
 * 协议已占用: 0x04 灯带 / 0x01 回充开关 / 0x00 安全防护, 0x05 是空的。 */
#define FUNC_RELAY         0x05     /* f[2] = 掩码: bit0 滚刷继电器 bit1 水泵继电器 */

/*-------------------------- 周期 --------------------------------*/
#define CAN_PERIOD_MS      20       /* 向电机重复发送的周期 */
#define ODOM_PERIOD_MS     20       /* 轮速采样/(可选)卡尔曼周期 (50Hz) */
#define TELEMETRY_PERIOD_MS 50      /* 上报周期 (20Hz) */
#define RPM_STALE_MS       200      /* 驱动器这么久没回码就认为转速无效 */

/*------------------- 轮速闭环修正 (外环 trim) ----------------------
 * 为什么需要:
 *   驱动器自己的速度环在小误差下给出的电流不足以快速突破静摩擦。实测原地
 *   转: 第 0 秒只有目标的 1%~26% —— **即使目标高达 43 RPM 也一样**; 而直线
 *   运动 0.07 秒就到 80%。同一个轮速区间表现差这么多, 所以这不是驱动器低速
 *   死区, 是原地转要克服轮胎刮擦/静摩擦。轮子是真的没转(不是空转打滑),
 *   所以把指令顶上去它就会转。
 *   STM32 这边原来是**纯开环**: 算完目标轮速直接发, 从不回读实际转速。
 *
 * ★ 第一版的教训 (已实测, 别重犯)
 *   第一版是"纯积分 + 绝对限幅 ±30 RPM + KI=1.5"。原地转的四秒总角度确实从
 *   41%~82% 提到了 85%~93%, 稳态也从 115% 回到了 101% —— 但代价是:
 *
 *   1. **绝对限幅在小名义值下会把指令顶成反向。** 原地转 wz=0.30 的名义轮速
 *      只有 13 RPM, 而修正量能到 -30, 于是 指令 = 13-30 = **-17 (轮子反转)**,
 *      车直接停住。直线 0.15 m/s (13.9 RPM) 更明显: 车中途往回走, 于是
 *      chassis_check 报出"后 40% 有 92% 但全程只有 26%"这种自相矛盾的数据。
 *      一个"修正"把自己修成了故障。
 *   2. **KI=1.5 太快, 和驱动器那个环组成慢速极限环。** 逐秒角速率变成
 *      过冲→塌陷→再爬: wz=1.00 是 0.43/1.73/0.90/0.54 (第 1 秒 173%)。
 *      积分增益和"被控对象滞后"的乘积大于 1 就会这样。
 *   3. 原注释里"输出永远落在普通全速命令能到的范围内"是**错的** ——
 *      MAX_RPM 是 200, 而 ±30 的绝对限幅在名义值 13 时已经把指令推到 2~3 倍。
 *
 * 第二版(现在)的三条改动, 逐条对症:
 *   a. **限幅改成按名义值的比例**(TRIM_UP_K / TRIM_DOWN_K), 不用绝对值。
 *      这样每种速度下行为一致, 而且反向最多只能减到名义值的一半 ——
 *      **修正量在任何情况下都不可能把指令的方向改掉**, 反转从机制上被消除。
 *   b. **KI 降到 0.6**, 让它只修稳态偏差, 不去和驱动器那个环抢动态。
 *   c. **起步助推 (kick) 单独做**, 见 KICK_*。突破静摩擦需要的是"立刻给力",
 *      而积分天生要"等误差攒起来"。把积分调快到能立刻给力, 它就会在轮子追上
 *      来之后迟迟不回, 造成上面那种过冲和振荡。两件事分开: 积分慢而稳只管
 *      稳态, 助推开环/定时/有界只管起步这一下 —— 开环所以不会构成第二个
 *      反馈回路, 也就不会振。
 *
 * 安全性(按"绝不引入新的失控模式"设计):
 *   1. 修正量按比例限幅(正向最多 +TRIM_UP_K 倍名义值, 反向最多 -TRIM_DOWN_K 倍),
 *      再受 TRIM_MAX_RPM 约束; 输出另受 MAX_RPM 约束。**净效果: 指令永远落在
 *      [1-TRIM_DOWN_K, 1+TRIM_UP_K] 倍名义值之内, 方向不变。**
 *   2. 目标为 0(停车/刹车/单轮不动)时修正量和助推一起清零, 不留历史。
 *   3. 驱动器回码不新鲜时不积分(只保持) —— 拿旧数据积分会把修正量喂到限幅。
 *   4. 修正量可从诊断帧推出(上报的"目标"是修正后的最终命令, 减去主机下发的
 *      理论目标就是修正量), 它有没有在乱冲一看便知。
 *=================================================================*/
/* ★ 第二版的实测结论(逐帧抓到了): 积分在**起步暂态**里把自己顶到限幅, 然后
 *   和驱动器的 PI 组成一个 0.25Hz 的极限环 —— `目标-理论` 那一列直接看得到:
 *       +7 -> +13(贴住限幅) -> +12 -> +9 -> +5 -> 0, 来回摆 ±14 RPM,
 *       周期 4~5 秒, 和速度振荡测出来的 0.25Hz 完全吻合。
 *   机制: 起步时轮子没转 -> 误差巨大 -> 积分顶到 +50% -> 指令 1.5 倍 ->
 *         驱动器本来就过冲 -> 实际冲到 52 RPM(名义 186%) -> 误差大幅反向 ->
 *         积分慢慢退回甚至摆到 -50% -> 指令 0.5 倍 -> 车慢下来 -> 积分又上去。
 *   而同一趟的**均值是 99%** —— 说明直行的稳态本来就不需要修, 积分没干好事。
 *
 * 所以第三版改三处, 都针对"别去积分它控制不了的暂态":
 *   a. **加线性带**(TRIM_LIN_BAND_RPM): 误差大于这个带就不积分。
 *      起步/被刮擦卡住时误差是 20~28 RPM, 落在带外 -> 完全不积分 ->
 *      从根上消掉那个 windup。轮子接近目标后才慢慢修稳态残差。
 *   b. **KI 0.6 -> 0.3**: 和外层拉开增益。驱动器里面已经有一个 PI 在管同一个
 *      误差, 两个积分器串在同一个误差上**必须拉开增益**, 否则必然振。
 *   c. **权限 ±50% -> ±20%**: 就算还有残余振荡, 幅度也被限在 ±20% 而不是
 *      ±50%(实测振幅就是限幅值本身)。稳态残差通常只有几个百分点, ±20% 够用。
 *
 * 助推(KICK)当时没动 —— 它只在起步那一小段起作用, 不在这个 0.25Hz 环里。
 * (助推后来在第四版改掉了, 见下面 KICK_* 那一段。) */
#define TRIM_ENABLE        1
#define TRIM_KI            0.3f     /* 每秒、每 1 RPM 偏差攒多少 RPM 修正 */
#define TRIM_UP_K          0.2f     /* 正向修正最多 +20% 名义值 */
#define TRIM_DOWN_K        0.2f     /* 反向修正最多 -20% 名义值 -> 永不反转 */
#define TRIM_MAX_RPM       20.0f    /* 绝对上限, 防高名义值下修正量过大 */
#define TRIM_LIN_BAND_RPM  5.0f     /* ★ 误差超过它就不积分(见上面第 a 条) */
#define TRIM_DEADBAND_RPM  0.5f     /* 目标小于这个就当"不该动", 全部清零 */

/* ★ 第三版(2026-09)【判据已被第四版取代, 这里只留下"为什么要动它"的来龙去脉】:
 *   助推从"一次性定时"改成"**卡住就给**"(带迟滞)。
 *
 * 为什么必须改 —— 实车报的"发小一点的转向命令, 车会愣在原地不动"就是这个:
 *   小原地转的单轮目标可能只有 8~13 RPM(对应 wz 0.2~0.3), 本来就在驱动器死区
 *   (~14~18 RPM)之下。旧逻辑靠助推把它顶到 20+ 破静摩擦, **但助推只有 400ms**,
 *   一到就撤; 撤掉后轮子掉回死区又卡住, 而助推**不会重新武装**(目标从没回到 0)
 *   -> 车就永远愣在原地。助推本来是为了解决"起步没劲", 结果在小命令上反而
 *   造了一个新故障。
 *
 * 第三版的判据(**已被第四版换掉, 因为它按名义值比例判定, 见下**):
 *     实际轮速 < 名义值 × 0.2   -> 给
 *     实际轮速 > 名义值 × 0.6   -> 撤
 *     中间                      -> 保持上一状态
 * 好处: 一直卡着就一直有助推(自愈, 不需要"重新武装"); 一旦真转起来立刻撤,
 * 过冲也被压小 —— 旧逻辑固定给满 400ms, 命令越大过冲越大。
 *
 * ★ 迟滞不能省: 单阈值会让助推在阈值附近按 20Hz 来回开关 -> 轮子嗡嗡抖。
 *
 * ★★ 助推必须是**两轮共享的一次判决**, 不能每轮各判一次(Boost_Decide)。
 *    助推是**加性**大增量, 在小命令下相当于把指令翻好几倍。若按各自转速独立
 *    判决, 转弯/起步时总有一个轮子先转起来、先撤掉助推, 另一个还在加 ——
 *    两轮指令瞬间差十几 RPM, 车就会"歪一下"。旧版是固定 400ms 定时, 两边
 *    同时给同时撤, 天然对称; 改成"卡住就给"之后必须显式做成共享, 否则等于
 *    凭空引入一个偏航源(而且它只在起步那一下出现, 最难查)。
 *    共享判据: **任一有效轮没转起来 -> 给; 两个有效轮都转起来了 -> 撤。**
 *
 * ==================================================================
 * 第四版(2026-09, 现在): 第三版那套"名义值比例"判据还是不对, 改成
 * **绝对转速判据 + 按缺口给量 + 给不动就加力**。原因是实车又报了两个症状,
 * 而它们是**同一条曲线的两端**:
 *     小命令(|名义| < ~15 RPM, 即 wz < 0.35)  -> 推不动, 一直愣在原地;
 *     稍大一点                                 -> 一下子窜出去, "转向太敏感"。
 * 这正是**静摩擦(起步门槛)**的特征, 而且 ★关键: 门槛是**起步**门槛, 不是
 * 速度死区 —— 实测转起来之后 6 RPM 也能维持(wz=0.30 的原地转测到 49%,
 * 也就是 6.4 RPM 真的在转)。所以"给一下就撤"是对的, "一直给"是错的。
 *
 * 第二版那套的两个毛病正好一人对应一个症状:
 *   a. 判据按**名义值比例**: 名义值只有 10 RPM 时, "转起来"的门槛是 6 RPM,
 *      而驱动器其实要 15 才动 —— 助推被判定为"已经转起来了"而提前撤掉,
 *      轮子掉回静止, 然后又"没跟上"再给, 于是在静止附近反复抖, 平均还是不动。
 *      (症状: 愣在原地)
 *   b. 助推量**固定 +12 RPM**, 而且**按各自名义方向加**。这一条对原地转的
 *      影响被严重低估了 —— 加性助推让右轮 +12、左轮 -12, 换算成偏航角速率:
 *          ω_rpm = wz × 43.26  (每轮名义转速 = wz 的 43.26 倍)
 *          所以助推 b 等效于把 wz 抬高 b / 43.26 rad/s
 *          b=12 -> **+0.28 rad/s**
 *      也就是原地转**起步那段时间真实 wz 比命令值高出约 0.28 rad/s**:
 *      wz=0.30 的命令实际是 0.58(192%), wz=0.50 的实际是 0.78(155%)。
 *      (症状: 转向太敏感 —— 而且这也解释了为什么**稳态**测出来是 100~102%
 *       却仍然手感"贼": 助推是暂态, 稳态数据里看不到它, 人却每次起步都能感到。
 *       旧版是固定 400ms 定时, 所以这个"窜"每次转向都准时出现 400ms。)
 *
 * 第四版三条:
 *   1. **绝对转速判"动没动"**(KICK_STILL_RPM / KICK_MOVING_RPM), 不看比例。
 *      要破的是静摩擦, "轮子转没转"这件事跟命令多大无关。
 *      副产物: 判据与命令大小无关 -> 大命令上不会过度助推, 也不会抖。
 *   2. **按缺口给量**(KICK_BASE_RPM):
 *          助推 = clamp(KICK_BASE_RPM - 最小|名义值|, 0, KICK_MAX_RPM)
 *      名义值本身就超过起步门槛 -> 助推 = 0 -> **正常行驶完全没有助推**:
 *        · 直行 0.30 m/s 名义 27.9 RPM -> 助推 0, 起步那一下的过冲消失;
 *        · 原地转 wz >= 15/43.26 = 0.35 -> 助推 0, **那 +0.28 rad/s 没有了**;
 *        · wz=0.30(名义 13 RPM) -> 助推 2 RPM   -> 额外 wz +0.05 (15%);
 *        · wz=0.25(名义 10.8)   -> 助推 4.2 RPM -> 额外 wz +0.10 (39%)。
 *      小命令上的超调仍然存在, 但它是**破静摩擦的物理代价**, 而且**只在
 *      |实际| < 6 RPM 的这段时间里存在**(一到 6 RPM 立刻撤, 见 KICK_MOVING_RPM)。
 *   3. **给不动就逐级加力**(KICK_STEP_*): 补到门槛还不动, 每 KICK_STEP_MS
 *      再加 KICK_STEP_RPM, 直到动起来或到 KICK_MAX_RPM。这样"到底要多大劲
 *      才动得起来"是**实测量出来的**, 不靠我猜的 KICK_BASE_RPM —— 它只是起点。
 *
 *   4. **加到上限还不转就"给一会儿歇一会儿"**(KICK_MAX_MS / KICK_COOL_MS):
 *      轮子被东西顶住时不能无限加力(会烤电机和驱动器), 所以加满上限还不动
 *      就先歇 KICK_COOL_MS, 再接着试, 并把 flags bit7 置位让上位机看得见。
 *      ★★ 这里**绝对不能做成"永久放弃"**。第一版的毛病就是"超时之后再也不给",
 *         于是小命令永远愣在原地 —— 如果这台车破静摩擦真的需要比 KICK_MAX_RPM
 *         更大的劲, 一次放弃就等于把那个故障原样造回来。占空比
 *         (3s 给 / 2s 歇) 已经能把堵转发热砍掉一大半, 而车最终还能脱困。
 *         目标归零时这个"歇"也一并清掉, 等于上层显式重下命令就重新给足机会。
 *
 * ★ 撤回判据用绝对值还有一个原因: 助推必须留到轮子进入"能自持"的转速
 *   (≈6 RPM) 才能撤。若按名义值的比例撤, 名义值 4 RPM 时会要求"转到 2.4
 *   才算转起来", 那时命令一撤回 4 RPM 轮子立刻又停 —— 助推变成振铃。 */
#define KICK_BASE_RPM      15.0f    /* 起步门槛估计: 助推把命令补到这个轮速 */
#define KICK_MAX_RPM       20.0f    /* 助推上限(含逐级加力) */
#define KICK_STEP_RPM      4.0f     /* 给不动 -> 每 KICK_STEP_MS 再加这么多 */
#define KICK_STEP_MS       200      /* 加力间隔 */
#define KICK_STILL_RPM     2.0f     /* |实际| 低于它 = 还是静止 */
#define KICK_MOVING_RPM    6.0f     /* |实际| 高于它 = 转起来了, 撤助推 */
#define KICK_MAX_MS        3000     /* 加到上限还不动, 先给这么久就歇一下(防卡死) */
#define KICK_COOL_MS       2000     /* ★ 歇多久再试。**不能永久放弃**, 见下面说明 */

/*-------------------------- IMU --------------------------------*/
/* IMU 读一次大概 1~3ms(位翻转 I2C), 和轮速一起按 ODOM_PERIOD_MS 采样。
 *
 * ★ 协议要求上报的 IMU 原始值必须是 ±2g / ±500dps 量程下的值, 因为上位机
 *   是用固定系数换算的(MD 5.1 节):
 *       加速度: 原始值 / 1671.84    = m/s²
 *       陀螺仪: 原始值 * 0.00026644 = rad/s
 *   而 YbImu 的原始量程是 ±16g / ±2000dps, 所以这里必须换算 + 限幅。
 *   换错量程不会报错, 只会让上位机的数据全错。
 */
#define IMU_ACCEL_G_TO_RAW  (9.80665f * 1671.84f)   /* g      -> ±2g   原始值 */
#define IMU_GYRO_TO_RAW     (1.0f / 0.00026644f)    /* rad/s  -> ±500dps 原始值 */
#define IMU_GYRO_Z_SIGN     1       /* 陀螺 Z 轴方向; 见下面 IMU_Tick 里的用法 */

/*=========================== 全局状态 ==============================*/
volatile uint32_t g_tick_ms;

