SkyHao723/sweeper_chassis/firmware/stm32-chassis/user/main.c
static void Relay_Init(void)
{
    GPIO_InitTypeDef gpio;

    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);

    gpio.GPIO_Pin = RELAY_BRUSH_PIN | RELAY_PUMP_PIN;
    gpio.GPIO_Mode = GPIO_Mode_Out_PP;
    gpio.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(RELAY_PORT, &gpio);

    Relay_Set(0);       /* 上电先全部断开, 不要一通电就抽水 */
}

/*======================== 命令帧 (11字节) ==========================
 * 帧头 + 定长 + 帧尾 + BCC。校验失败时整体左移一字节重新同步,
 * 这样即使中间丢了字节也能自己找回来。
 *=================================================================*/
static float ClampF(float v, float lo, float hi)
{
    if (v < lo) return lo;
    if (v > hi) return hi;
    return v;
}

static uint8_t Cmd_Verify(const uint8_t *f)
{
    uint8_t i;
    uint8_t bcc = 0;

    if (f[0] != CMD_HEAD) return 0;
    if (f[CMD_FRAME_SIZE - 1] != TEL_TAIL) return 0;
    for (i = 0; i < CMD_FRAME_SIZE - 2; i++)
    {
        bcc ^= f[i];
    }
    return (bcc == f[CMD_FRAME_SIZE - 2]);
}

/*========================= 命令帧应用 =============================
 * 只有一个上位机, 没有控制权仲裁 —— 收到合法帧就认。
 * 继电器是"锁存式开关", 任何时候都可以操作。
 *
 * ★ 进来就记 last_frame_ms: 能走到这里的帧都过了长度+帧尾+BCC 校验, 足以证明
 *   上位机还活着。但**不**动 last_cmd_ms —— 那个只认速度帧, 否则发一堆灯带帧
 *   就能把运动看门狗喂饱, 车会一直跑下去。见主循环里的看门狗。
 *=================================================================*/
static void Cmd_Apply(uint8_t port_id, const uint8_t *f)
{
    int16_t vx_mm;
    int16_t wz_mrad;

    last_frame_ms = g_tick_ms;

    /* ---- 功能帧: f[1] 是功能码, 不是速度帧 ---- */
    if (f[1] == FUNC_RELAY)
    {
        Relay_Set(f[2]);            /* f[2] = 掩码 bit0 滚刷 bit1 水泵 */
        if (ports[port_id].ok_count != 0xFF) ports[port_id].ok_count++;
        return;
    }

    /* ---- 协议里的其它功能帧: 本工程没实现, 必须忽略 ----
     * 这些帧和速度帧同为 11 字节、同头同尾, 靠 f[1]/f[2] 区分
     * (docs/chassis-serial-protocol.md 第 6 节):
     *     f[1]=0x04             灯带       f[2]=EN, f[3..5]=RGB
     *     f[1]=1, f[2]=0xA0/0xA1 回充开关
     *     f[1]=0, f[2]=0xB0/0xB1 底盘安全防护
     * ★ 绝对不能当速度帧解析 —— 那样 f[3..8] 会被误读成 vx/wz, 车会乱窜。
     *   正常速度帧的 f[1] 只可能是 AutoRecharge(0/1), 所以 f[1]>1 一律不是速度帧。
     */
    if ((f[1] > 1) ||
        ((f[1] == 1) && ((f[2] == 0xA0) || (f[2] == 0xA1))) ||
        ((f[1] == 0) && ((f[2] == 0xB0) || (f[2] == 0xB1))))
    {
        if (ports[port_id].ok_count != 0xFF) ports[port_id].ok_count++;
        return;
    }

    /* ---- 速度帧 ---- */
    /* f[1]=AutoRecharge  f[2]=SecurityPLY  f[5..6]=vy (差速车忽略) */
    vx_mm = (int16_t)(((uint16_t)f[3] << 8) | f[4]);
    wz_mrad = (int16_t)(((uint16_t)f[7] << 8) | f[8]);
    if (ports[port_id].ok_count != 0xFF) ports[port_id].ok_count++;

    if (port_id != PORT_MAIN)
    {
        return;                     /* 只认 PA9/PA10, 别的口一律不理 */
    }

    target_vx = ClampF((float)vx_mm / 1000.0f, -MAX_LIN_SPEED, MAX_LIN_SPEED);
    target_wz = ClampF((float)wz_mrad / 1000.0f, -MAX_YAW_RATE, MAX_YAW_RATE);

    /* ★ 滚刷和水泵都**不**自动合闸。
       两个继电器都是"外设开关", 只能由上位机显式发 f[1]=0x05 帧
       (f[2] = 掩码: bit0 滚刷 bit1 水泵)。

       ★ 历史上这里会自动合上 PB0, 理由是"不合闸电机就没电" —— 但那个"电机"
         指的是**轮毂驱动电机**, 而继电器根本不管它(驱动器独立常电)。理由本身
         就是错的, 于是实际效果变成了"一给运动命令扫地滚刷就转", 一个没人明确
         决定过的副作用。**已改成显式控制。**

       ⚠ 后果要说清楚: 厂商 ROS 节点不认识这条自定义帧, 而且它独占串口 ——
         所以在 ROS 栈跑着的时候**没法开关滚刷**, 需要另加一条控制通路。
         台架上可以先用 tools/decode_diag.py --relay 直接开关。
         详见 README 的继电器一节。 */

    last_cmd_ms = g_tick_ms;
    ever_linked = 1;
    failsafe_latched = 0;
}

static void Port_Feed(uart_port_t *p, uint8_t value)
{
    uint8_t i;

    if (p->len >= CMD_FRAME_SIZE)
    {
        /* 上一帧没通过校验, 左移一字节用滑动窗口重新找帧头 */
        for (i = 1; i < CMD_FRAME_SIZE; i++)
        {
            p->frame[i - 1] = p->frame[i];
        }
        p->len = CMD_FRAME_SIZE - 1;
    }

    p->frame[p->len++] = value;

    if (p->len == CMD_FRAME_SIZE)
    {
        if (Cmd_Verify(p->frame))
        {
            Cmd_Apply(p->id, p->frame);
            p->len = 0;
        }
        else if (p->bad_count != 0xFF)
        {
            p->bad_count++;
        }
        /* 校验失败时保留数据, 下次进来左移重试 */
    }
}

static void Port_ProcessCommands(uart_port_t *p)
{
    while (p->tail != p->head)
    {
        uint8_t value = p->ring[p->tail];
        p->tail = (uint8_t)((p->tail + 1) & 0x3F);
        Port_Feed(p, value);
    }
}

/*========================= 轮速计 ==================================
 * 把两个电机的实际转速按接线校准成"左轮/右轮物理转速",
 * 再正解出车体速度 (vx, wz) 供上报。
 *=================================================================*/
static void Wheel_Update(void)
{
    int16_t a = m1_rpm;
    int16_t b = m2_rpm;
    uint8_t f1, f2;
    float v_left;
    float v_right;

    /* 驱动器掉线时实际转速会一直停在最后一个值, 必须当成 0, 否则会飘。
       同时把"新鲜度"单独记下来 —— 外环积分必须知道这个数是真值还是残值,
       拿残值积分会把修正量一路喂到限幅。 */
    f1 = ((g_tick_ms - m1_rpm_ms) > RPM_STALE_MS) ? 0 : 1;
    f2 = ((g_tick_ms - m2_rpm_ms) > RPM_STALE_MS) ? 0 : 1;
    if (!f1) a = 0;
    if (!f2) b = 0;

    /* 驱动器报的是"命令方向"上的转速, 按安装校准换算成物理方向 */
    if (MOTOR1_INVERT) a = (int16_t)(-a);
    if (MOTOR2_INVERT) b = (int16_t)(-b);

    if (MOTOR1_IS_LEFT)
    {
        wheel_left_rpm = a;
        wheel_right_rpm = b;
        wheel_left_fresh  = f1;
        wheel_right_fresh = f2;
    }
    else
    {
        wheel_left_rpm = b;
        wheel_right_rpm = a;
        wheel_left_fresh  = f2;
        wheel_right_fresh = f1;
    }

    /* 正向运动学: 左右轮线速度 -> 车体速度 (协议里上报的就是这个) */
    v_left  = (float)wheel_left_rpm  * WHEEL_CIRC_M / 60.0f;
    v_right = (float)wheel_right_rpm * WHEEL_CIRC_M / 60.0f;
    body_vx = (v_left + v_right) * 0.5f;
    body_wz = (v_right - v_left) / TRACK_WIDTH_M;
}

/*========================= 起步助推判决 ============================
 * 两轮**共享**的一次判决, 返回这一周期要叠加的助推量 RPM。
 * 为什么必须共享、不能每轮各判, 见上面 KICK_* 说明里那一段。
 *
 * 判据(绝对转速 + 迟滞):
 *   任一"有效轮" |实际| < KICK_STILL_RPM    -> 给
 *   两个"有效轮" |实际| > KICK_MOVING_RPM   -> 撤
 *   其余(在迟滞带里 / 反馈不新鲜)           -> 保持上一状态
 * 所谓"有效轮" = |名义值| >= TRIM_DEADBAND_RPM 的那一轮。原地转时两轮名义值
 * 大小一样; 混合了 vx 的转弯里两轮可能一大一小, 只要**小的那个**卡住就得给。
 *
 * ★ 反馈不新鲜时**倾向于不撤**(保持当前状态): 没有观测就不敢做结论。
 *   注意 Drive_Ready() 已经保证走到这里时两路回码都是新鲜的, 这条只是兜底。
 *
 * ★ 目标全归零 -> 状态全清, 包括"卡住过"的锁存标志。这样"停一下再走"能
 *   重新获得完整的加力过程, 而停在地上的车不会带着历史。
 *
 * ★ 助推量怎么定(见 KICK_BASE_RPM / KICK_STEP_*):
 *     起始量 = clamp(KICK_BASE_RPM - 最小有效|名义值|, 0, KICK_MAX_RPM)
 *     还不动 -> 每 KICK_STEP_MS 再加 KICK_STEP_RPM, 到 KICK_MAX_RPM 封顶
 *   用**最小**的那个名义值算, 因为要救的是"命令最小、最容易卡住"的那个轮子。
 *
 * ★ 助推对 (vx, wz) 的影响 —— 这一点很容易想错, 必须写清楚:
 *   助推是**按各自名义方向**加的, 所以影响取决于两轮名义值**同号还是异号**:
 *     · 原地转(wz≠0, vx=0): 两轮名义值**异号** -> 助推把两轮往相反方向推 ->
 *       差分 D = ω_r - ω_l 增加 2×助推 -> **偏航被抬高**, Δwz = 助推/43.26。
 *       这就是"转向太敏感"的来源, 也是第四版要在 |wz|≥0.35 上把助推压到 0
 *       的原因。
 *     · 边走边转(vx 足够大, 两轮名义值**同号**): 助推给两轮加的是**同一个
 *       方向** -> 差分**完全不变** -> **偏航一点没变**, 只是车临时多往前冲了
 *       助推那么多。此时 wz 是诚实的, 不需要担心"转向变敏感"。
 *       (比如 vx=0.30 + wz=0.50: 左轮 6.3 RPM、右轮 49.5 RPM, 助推 8.7 会
 *        让两轮都 +8.7, wz 不变, 只有 vx 短暂偏高 —— 而 vx 偏高正是我们要的
 *        "破静摩擦", 外环积分随后会把两轮一起收回来。)
 *=================================================================*/
static float Boost_Decide(float nom_l, float nom_r,
                          float act_l, float act_r,
                          uint8_t fresh_l, uint8_t fresh_r, float dt)
{
#if TRIM_ENABLE
    float mag_l = fabsf(nom_l);
    float mag_r = fabsf(nom_r);
    float smallest = 0.0f;      /* 最小的有效名义值 —— 决定起始助推量 */
    uint8_t any_valid = 0;
    uint8_t give = 0;           /* 有轮子还静止 */
    uint8_t all_moving = 1;     /* 所有有效轮都确认转起来了 */
    uint8_t still_all = 1;      /* 所有有效轮都还静止(决定要不要继续加力) */
    uint16_t dms;

