SkyHao723/sweeper_chassis/firmware/stm32-chassis/user/main.c
    /*---- 全零: 状态清干净, 不留历史 ----*/
    if ((mag_l < TRIM_DEADBAND_RPM) && (mag_r < TRIM_DEADBAND_RPM))
    {
        boost_on      = 0;
        boost_amt     = 0.0f;
        boost_ms      = 0;
        boost_step_ms = 0;
        boost_cool_ms = 0;      /* 上层显式重下命令 -> "歇"也清掉, 重新给足机会 */
        boost_stuck   = 0;      /* 目标归零 -> 清掉"卡住过"的锁存标志 */
        return 0.0f;
    }

    if (mag_l >= TRIM_DEADBAND_RPM)
    {
        any_valid = 1;
        smallest  = mag_l;
        if (fresh_l)
        {
            float a = fabsf(act_l);
            if (a < KICK_STILL_RPM)   give = 1;
            if (a <= KICK_MOVING_RPM) all_moving = 0;
            if (a >= KICK_STILL_RPM)  still_all = 0;
        }
        else
        {
            all_moving = 0;     /* 没观测 -> 不撤 */
            still_all  = 0;     /* 没观测 -> 也不加力 */
        }
    }
    if (mag_r >= TRIM_DEADBAND_RPM)
    {
        any_valid = 1;
        if ((mag_r < smallest) || (smallest <= 0.0f)) smallest = mag_r;
        if (fresh_r)
        {
            float a = fabsf(act_r);
            if (a < KICK_STILL_RPM)   give = 1;
            if (a <= KICK_MOVING_RPM) all_moving = 0;
            if (a >= KICK_STILL_RPM)  still_all = 0;
        }
        else
        {
            all_moving = 0;
            still_all  = 0;
        }
    }

    if (!any_valid)
    {
        boost_on      = 0;      /* 理论上到不了这里, 兜底 */
        boost_amt     = 0.0f;
        boost_ms      = 0;
        boost_step_ms = 0;
        boost_cool_ms = 0;
        return 0.0f;
    }

    /*---- 状态机: 给 / 撤 / 保持 ----*/
    if (give)
    {
        if (!boost_on)
        {
            /* 刚开: 按"补到起步门槛"算起始量; 名义值已经够大就是 0 ——
               正常行驶(直行 0.30 m/s 名义 27.9 RPM)从这里开始就完全没有助推,
               旧版那个固定 +12 造成的起步过冲随之消失。 */
            boost_on      = 1;
            boost_amt     = KICK_BASE_RPM - smallest;
            if (boost_amt < 0.0f)          boost_amt = 0.0f;
            if (boost_amt > KICK_MAX_RPM)  boost_amt = KICK_MAX_RPM;
            boost_ms      = 0;
            boost_step_ms = 0;
        }
    }
    else if (all_moving)
    {
        boost_on      = 0;      /* 转起来了 -> 立刻撤 */
        boost_amt     = 0.0f;
        boost_ms      = 0;
        boost_step_ms = 0;
        boost_cool_ms = 0;
    }
    /* 其余情况保持上一状态(迟滞带防抖) */

    if (!boost_on)
    {
        return 0.0f;
    }

    /* 计时。dt 极小(卡顿后立刻恢复)时至少算 1ms, 否则计时永远不动,
       防卡死保护就失效了。 */
    dms = (uint16_t)(dt * 1000.0f + 0.5f);
    if (dms == 0) dms = 1;
    boost_ms = (uint16_t)(boost_ms + dms);

    /*---- 防卡死"歇一会儿"中: 这一周期不给力 ----*/
    if (boost_cool_ms > 0)
    {
        boost_cool_ms = (boost_cool_ms > dms) ? (uint16_t)(boost_cool_ms - dms) : 0;
        return 0.0f;
    }

    /*---- 逐级加力: 只在"都还静止"时加 ----
       已经在迟滞带里(有一个轮子转起来一点了)就保持当前量, 不加也不撤。 */
    if (still_all)
    {
        if ((boost_amt >= KICK_MAX_RPM) && (boost_ms >= KICK_MAX_MS))
        {
            /* 防卡死保护: 已经顶到上限 push 满 KICK_MAX_MS 还一直不动, 说明
               轮子被东西顶住了 —— 再给下去要烤电机和驱动器。歇 KICK_COOL_MS
               再接着试(★ 不是永久放弃, 理由见 KICK_COOL_MS 上面那段),
               并**锁存** flags bit7 让上位机看得见。 */
            boost_stuck   = 1;
            boost_ms      = 0;
            boost_step_ms = 0;
            boost_cool_ms = KICK_COOL_MS;
            return 0.0f;
        }

        boost_step_ms = (uint16_t)(boost_step_ms + dms);
        if ((boost_step_ms >= KICK_STEP_MS) && (boost_amt < KICK_MAX_RPM))
        {
            boost_step_ms = 0;
            boost_amt += KICK_STEP_RPM;
            if (boost_amt > KICK_MAX_RPM) boost_amt = KICK_MAX_RPM;
        }
    }
    else
    {
        boost_step_ms = 0;      /* 不是全静止就不加力 */
    }

    return boost_amt;
#else
    (void)nom_l; (void)nom_r; (void)act_l; (void)act_r;
    (void)fresh_l; (void)fresh_r; (void)dt;
    boost_stuck = 0;        /* 诊断帧读它, 所以这条路径也必须赋值 */
    /* ★ A/B 路径里助推整段不编译, 这几个状态没有任何读者。显式吃掉,
       否则 TRIM_ENABLE=0 的构建会多几条 550-D 警告(不是错误, 但会遮住
       别的真警告)。 */
    (void)boost_on;
    (void)boost_amt;
    (void)boost_ms;
    (void)boost_step_ms;
    (void)boost_cool_ms;
    return 0.0f;
#endif
}

/*========================= 轮速外环修正 ============================
 * 按实际轮速修目标轮速, 返回真正要发给驱动器的转速。
 * 两部分: 慢积分修稳态偏差 + 助推破静摩擦。
 * 为什么这么分、第一版错在哪, 见上面 TRIM_* / KICK_* 那一大段。
 *
 * nominal / actual 都在物理轮速域(已按接线校准), 可以直接相减。
 * boost 由 Boost_Decide() 在 Drive_Apply 里**算一次给两轮共享**(理由见那里),
 * 本函数只负责"按名义方向把它加上去"。
 *
 *★ 输出保证: 落在 [1-TRIM_DOWN_K, 1+TRIM_UP_K] 倍名义值之内(助推另加),
 *  且**方向永远和名义值一致** —— 修正不可能把车修成倒着走。
 *=================================================================*/
static float Trim_Apply(wheel_trim_t *w, float nominal, float actual,
                        uint8_t fresh, float dt, float boost)
{
    float out;

#if TRIM_ENABLE
    float mag;
    float up;
    float dn;

    mag = fabsf(nominal);

    /*---- 不该动: 修正清零, 不留任何历史 ----
       (助推/计时的清零在 Boost_Decide 里, 因为它是共享的) */
    if (mag < TRIM_DEADBAND_RPM)
    {
        w->trim = 0.0f;
        return 0.0f;
    }

    /*---- 慢积分: 只修稳态偏差 ----
       ★ 只在**线性带内**积分。实测: 起步时轮子没转, 误差 20~28 RPM,
         积分会一路顶到限幅, 然后和驱动器的 PI 组成 0.25Hz 极限环
         (`目标-理论` 在 ±14 RPM 之间来回摆, 和速度振荡频率完全吻合)。
         误差超出这个带说明轮子"还没跟上", 那是助推和驱动器该管的事,
         外环不该在控制不了的暂态里攒积分。 */
    if (fresh)
    {
        float e = nominal - actual;
        if ((e < TRIM_LIN_BAND_RPM) && (e > -TRIM_LIN_BAND_RPM))
        {
            w->trim += TRIM_KI * e * dt;
        }
    }

    /*---- 限幅: 按名义值的比例, 不用绝对值 ----
       反向最多 -TRIM_DOWN_K 倍名义值, 所以指令的正负号永远不变。
       第一版用的是绝对 ±30 RPM, 在名义值只有 13 RPM 的原地转上把指令
       顶成了 13-30 = -17, 轮子反转、车停住 —— 比例限幅从机制上消除它。 */
    up = mag * TRIM_UP_K;
    dn = mag * TRIM_DOWN_K;
    if (up > TRIM_MAX_RPM) up = TRIM_MAX_RPM;
    if (dn > TRIM_MAX_RPM) dn = TRIM_MAX_RPM;
    if (w->trim >  up) w->trim =  up;
    if (w->trim < -dn) w->trim = -dn;

    out = nominal + w->trim;

    /* 助推按名义方向叠加 —— boost 是 Boost_Decide 给的两轮共享值, 这里无脑加,
       不再各自判决(每轮各判会让两轮指令差 12 RPM, 起步车会歪) */
    if (boost > 0.0f)
    {
        out += (nominal > 0.0f) ? boost : -boost;
    }
#else
    (void)actual;
    (void)fresh;
    (void)dt;
    (void)boost;            /* A/B 路径里助推整段不编译, 这里显式吃掉免警告 */
    w->trim = 0.0f;
    out = nominal;
#endif

    out = ClampF(out, -(float)MAX_RPM, (float)MAX_RPM);

    /* ★ 最后一道保险: 修正 + 助推绝不允许把指令的方向改掉。
       名义为正就保证输出 >= 0, 名义为负就保证输出 <= 0。
       即使上面的限幅哪天被人改错了, 这一条也能兜住。 */
    if ((nominal > 0.0f) && (out < 0.0f)) out = 0.0f;
    if ((nominal < 0.0f) && (out > 0.0f)) out = 0.0f;

    return out;
}

