SkyHao723/sweeper_chassis/firmware/stm32-chassis/user/main.c
/*===================== 驱动器就绪判断 ==============================
 * 差速车只有一个轮子出力就等于原地打转, 所以**没确认两个驱动器都活着之前,
 * 只发刹车、绝不发速度** —— 直行命令变成左转就是这么来的(见 drv_seen_mask)。
 *
 * 判据是两条, 都要满足:
 *   1. 两个驱动器**各自回过码**(证明 CAN 通、驱动器活着);
 *   2. 两路回码**现在都还新鲜** —— 用一次就够不算数, 半路掉线的驱动器必须
 *      立刻让车停下来, 否则又是一次"单轮驱动 = 原地打转"。
 *
 * 为什么不会死锁: 等待期间 Drive_Apply 每 20ms 发的是**刹车帧**, 而驱动器对
 * 刹车帧同样会回码, 所以回码一定会来。万一 CAN 真断了就一直刹车 ——
 * 这正是应该的结果(驱动器都没通, 本来就不该动)。
 *=================================================================*/
static uint8_t Drive_Ready(void)
{
    if ((drv_seen_mask & 0x03) != 0x03) return 0;             /* 有一路从没回过 */
    if ((g_tick_ms - m1_rpm_ms) > RPM_STALE_MS) return 0;     /* 1号现在不回了 */
    if ((g_tick_ms - m2_rpm_ms) > RPM_STALE_MS) return 0;     /* 2号现在不回了 */
    return 1;
}

/*========================= 差速逆解 ================================
 * 车体 (vx, wz) -> 左右轮目标转速。差速车用不到 vy。
 *   v_left  = vx - wz * b/2
 *   v_right = vx + wz * b/2
 *=================================================================*/
static void Drive_Apply(void)
{
    /* 外环积分用的真实周期。主循环里还夹着 IMU 读取(1~3ms)等开销, 实际周期
       会比 CAN_PERIOD_MS 略大; 用固定值会让 TRIM_KI 的实际含义随负载漂移,
       参数就没法标定了。异常值(第一次调用/计时器回绕/严重卡顿)兜底成标称值。 */
    static uint32_t last_trim_ms = 0;
    float dt = (float)(g_tick_ms - last_trim_ms) * 0.001f;

    float v_left = target_vx - target_wz * (TRACK_WIDTH_M * 0.5f);
    float v_right = target_vx + target_wz * (TRACK_WIDTH_M * 0.5f);
    float rpm_l = v_left / WHEEL_CIRC_M * 60.0f;
    float rpm_r = v_right / WHEEL_CIRC_M * 60.0f;
    float cmd_l;
    float cmd_r;
    float boost;
    int16_t m1;
    int16_t m2;

    if ((dt <= 0.0f) || (dt > 0.2f)) dt = (float)CAN_PERIOD_MS * 0.001f;
    last_trim_ms = g_tick_ms;      /* 就算下面提前 return 也要更新, 免得恢复时 dt 爆掉 */

    /* ★ 驱动器没都就绪: 只发刹车, 绝不发速度。
       差速车单轮出力 = 原地打转, 而实测真的出现过"直行命令变成向左转"。
       顺便把外环状态清零, 免得带着上一次攒的修正冲出去。 */
    if (!Drive_Ready())
    {
        trim_w[TRIM_IDX_LEFT].trim  = 0.0f;
        trim_w[TRIM_IDX_RIGHT].trim = 0.0f;
        boost_on      = 0;  /* 停过之后助推状态也清干净 */
        boost_amt     = 0.0f;
        boost_ms      = 0;
        boost_step_ms = 0;
        boost_cool_ms = 0;
        boost_stuck   = 0;
        target_left_rpm  = 0;
        target_right_rpm = 0;
        CAN1_SendStop(MOTOR1_CAN_ID);
        CAN1_SendStop(MOTOR2_CAN_ID);
        return;
    }

    rpm_l = ClampF(rpm_l, -(float)MAX_RPM, (float)MAX_RPM);
    rpm_r = ClampF(rpm_r, -(float)MAX_RPM, (float)MAX_RPM);

    /* 起步助推: **一次判决, 两轮共用**(见 KICK_* 最后一段)。必须放在两次
       Trim_Apply 之前, 而且只调一次 —— 每轮各判一次会让两轮指令差 12 RPM。 */
    boost = Boost_Decide(rpm_l, rpm_r,
                         (float)wheel_left_rpm, (float)wheel_right_rpm,
                         wheel_left_fresh, wheel_right_fresh, dt);

    /* 外环修正: 用实际轮速去修目标轮速。原地转起步时轮子是真的没转, 这里会把
       指令顶上去直到它真的转; 稳态偏高时又会把指令压回来。
       ★ 目标为 0 时 Trim_Apply 恒定返回 0, 而且它保证输出方向和名义值一致,
         所以外环**不可能**在主机下令停车的时候把车带着走, 也不可能把某个轮子
         修成倒转 —— 这是这套做法敢上车的底线。 */
    cmd_l = Trim_Apply(&trim_w[TRIM_IDX_LEFT], rpm_l,
                       (float)wheel_left_rpm, wheel_left_fresh, dt, boost);
    cmd_r = Trim_Apply(&trim_w[TRIM_IDX_RIGHT], rpm_r,
                       (float)wheel_right_rpm, wheel_right_fresh, dt, boost);

    /* 物理轮速 -> CAN 命令 (反向应用接线校准) */
    if (MOTOR1_IS_LEFT) { m1 = (int16_t)cmd_l; m2 = (int16_t)cmd_r; }
    else                { m1 = (int16_t)cmd_r; m2 = (int16_t)cmd_l; }
    if (MOTOR1_INVERT) m1 = (int16_t)(-m1);
    if (MOTOR2_INVERT) m2 = (int16_t)(-m2);

    /* 上报的是**最终真正发给驱动器**的物理轮速(含外环修正), 不是电机命令,
       免得左右概念混淆。主机拿自己下发的理论目标去减, 就是外环修正量。 */
    target_left_rpm  = (int16_t)cmd_l;
    target_right_rpm = (int16_t)cmd_r;

    /*===================== 走 / 停 两态 =====================
     * 停车就是一条 STOP_CTRL 帧, 每个控制周期重发。
     * 不切模式、不记忆状态、不引用位置 —— 出问题只可能出在电机或接线,
     * 不可能出在这几行逻辑上。这是上一版"位置锁位"失控后刻意保留的简单。
     *=======================================================*/
    if ((m1 != 0) || (m2 != 0))
    {
        CAN1_SendSpeed(MOTOR1_CAN_ID, m1);
        CAN1_SendSpeed(MOTOR2_CAN_ID, m2);
    }
    else
    {
        CAN1_SendStop(MOTOR1_CAN_ID);
        CAN1_SendStop(MOTOR2_CAN_ID);
    }
}

/*======================= IMU (YbImu) ==============================
 * 按 ODOM_PERIOD_MS 采一次。读失败不清零 —— 保留上一次的值。
 *
 * 还会记录一串诊断状态, 读失败时最多每秒做一次总线检查 + 地址扫描,
 * 结果通过诊断帧上报 —— 否则"读取失败"这四个字什么信息都没有。
 *=================================================================*/
#define IMU_DIAG_PERIOD_MS  1000

static void IMU_Tick(void)
{
    float accel[3];
    float gyro[3];
    uint8_t err;

    err = YbImu_ReadMotion(accel, gyro);

    if (err == YBIMU_ST_OK)
    {
        imu_accel_g[0] = accel[0];
        imu_accel_g[1] = accel[1];
        imu_accel_g[2] = accel[2];
        imu_gyro[0] = gyro[0];
        imu_gyro[1] = gyro[1];
        /* ★ Z 轴方向在这里生效。IMU_GYRO_Z_SIGN 以前是个死宏(只定义没使用),
           现在接回来了 —— 否则万一陀螺仪 Z 装反了, 上位机 EKF 会拿它去
           "纠正"轮速, 越纠越偏, 而且没有任何可调的地方。
           验证方法: 把车从上方看**逆时针**转(左转),
           `ros2 topic echo /imu/data_raw --field angular_velocity`
           的 z 应该是**正的**。反了就把它改成 -1。 */
        imu_gyro[2] = gyro[2] * (float)IMU_GYRO_Z_SIGN;

        /* 静止时模块会把角速度输出归零, 那是正常行为, 不是故障。
           所以"读数是否为零"判断不了陀螺仪死活 —— 这里改成记录
           "自开机以来有没有读到过非零角速度": 车动过之后它还是 0,
           才说明陀螺仪真有问题。诊断帧的 bit3 报的就是这个。 */
        if ((gyro[0] != 0.0f) || (gyro[1] != 0.0f) || (gyro[2] != 0.0f))
        {
            imu_gyro_ok = 1;
        }

        imu_ok = 1;
        imu_status = YBIMU_ST_OK;
        imu_found_addr = YBIMU_I2C_ADDR;
    }
    else
    {
        imu_ok = 0;
        imu_gyro_ok = 0;
        imu_status = err;

        /* 失败了才诊断, 而且不要每次都跑。
         *
         * ★ 而且**只在车停着的时候诊断**。原因: 地址扫描要遍历 0x08~0x77
         *   共 112 个地址, 位翻转 I2C 全程要 100~150ms —— 这段时间主循环被
         *   堵住, CAN 命令发不出去, 车会一顿一顿的。诊断是给"停车排查"用的,
         *   行驶中不需要, 更不该干扰控制。
         *   (现在 IMU 正常所以看不出来; 但一旦 IMU 坏了, 诊断本身就会变成
         *    一个新的故障源 —— 这种"为了查问题而制造问题"的坑踩过。) */
        if ((g_tick_ms - imu_diag_ms) >= IMU_DIAG_PERIOD_MS)
        {
            if ((target_vx == 0.0f) && (target_wz == 0.0f))
            {
                uint8_t bus = YbImu_BusCheck();
                imu_diag_ms = g_tick_ms;

                if (bus != YBIMU_ST_OK)
                {
                    imu_status = bus;               /* 总线本身就不对 */
                    imu_found_addr = 0;
                }
                else
                {
                    imu_found_addr = YbImu_Scan();  /* 总线是好的, 那就是地址/器件问题 */
                    imu_status = (imu_found_addr == 0) ? YBIMU_ST_NO_ACK : YBIMU_ST_READ_ERR;
                }
            }
            else
            {
                /* 在动, 只记录"读失败", 等停下来再做重诊断 */
                imu_diag_ms = g_tick_ms - IMU_DIAG_PERIOD_MS + 100;
            }
        }
    }

    /* 寄存器体检 (1Hz), 放最后 —— 它读得最长(0x16 是 16 字节), 万一出问题
       也不该影响上面那次关键的运动数据读取。 */
    if ((g_tick_ms - imu_probe_ms) >= IMU_DIAG_PERIOD_MS)
    {
        YbImu_Probe_t pr;

        imu_probe_ms = g_tick_ms;
        YbImu_Probe(&pr);
        imu_probe_flags = (uint8_t)((pr.ver_ok   ? 0x01 : 0) |
                                    (pr.gyro_ok  ? 0x02 : 0) |
                                    (pr.mag_ok   ? 0x04 : 0) |
                                    (pr.quat_ok  ? 0x08 : 0) |
                                    (pr.euler_ok ? 0x10 : 0));
        imu_ver_major = pr.ver[0];
        imu_euler_yaw_crad = (int16_t)(pr.euler_yaw * 100.0f);   /* rad -> 0.01rad */
    }
}

/* 物理量 -> 协议规定的 ±2g / ±500dps 原始值, 带限幅(超量程夹住而不是回绕) */
static int16_t IMU_AccelToRaw(float accel_g)
{
    float v = accel_g * IMU_ACCEL_G_TO_RAW;

    if (v >  32767.0f) v =  32767.0f;
    if (v < -32768.0f) v = -32768.0f;
    return (int16_t)v;
}

